<html>

<head>
	<title>EPKfix Projekt</title>
</head>

<body>
	<h1>EPKfix Projekt (Historische Daten)</h1>

	<h2>Vorwort von Thomas Michel</h2>
	<p>
		Das auf dieser Website beschriebene Projekt begann ca. 1995 und endete ca. 1997/98. Es erfolgte eine F&ouml;rderung durch
		Bundesministerium f&uuml;r Bildung und Forschung BMBF. Am Projekt beteiligt waren folgende Partner:
		<ul>
			<li><a href="http://www.forwiss.uni-erlangen.de/fg-we/projekte/EPKfix.html">FORWISS-Erlangen</a></li>
			<li><a href="http://www.informatik.tu-darmstadt.de/PU/projekte/EPKfix/INDEX.HTML">TH Darmstadt</a></li>
			<li><a href="http://www.pst.informatik.uni-muenchen.de/projekte/proj-desc/epkfix.html">LMU M&uuml;nchen</a></li>
			<li><a href="http://www.inf.tu-dresden.de/~lr1/epk/">TU Dresden</a></li>
			<li><a href="http://www.mediatec.de/">mediatec, N&uuml;rnberg</a></li>
		</ul>
		Nach einiger Zeit nun musste ich feststellen, dass viele Informationen im WWW zerstreut lagern und kaum noch gewartet werden.
		Aus meiner Sicht werden in einigen wenigen Jahren keine Informationen mehr zum Projekt &uuml;ber das WWW erh&auml;ltlich
		sein. Aus diesem Grund habe ich begonnen alle noch auffindbaren Informationen zusammenzutragen.
	</p>
	<p>
		In einem ersten Schritt habe ich mich darauf beschr&auml;nkt die Texte aus den gefundenen Seiten zu kopieren. Daher m&ouml;chte
		ich Sie bitten mich nicht gleich zu verklagen, ich werde nach und nach entsprechende Quellennachweise anbringen bzw. die
		Texte neu schreiben. Eine Mail an
		<strong><a href="mailto:huluvu424242@gmail.com?subject=EPKfix Projekt Webseite">huluvu424242 at gmail.com</a></strong> gen&uuml;gt und ich werde die Passagen welche Ihren Unmut wecken vom Netz nehmen bzw. wenn m&ouml;glich &uuml;berarbeiten.
		Noch netter w&auml;ren jedoch Textbeitr&auml;ge welche ich mit Quellenangabe einstellen kann.
	</p>
	<h2>Projektbeschreibung</h2>
	<p>
		F&uuml;r Anbieter aller Branchen werden elektronische Medien f&uuml;r Produktpr&auml;sentation und -verkauf zunehmend interessant
		und unverzichtbar. Die Idee des "Home shopping" &uuml;ber CD-Rom, BTX oder online &uuml;ber Modem ist zwar relativ jung,
		veranla&szlig;t jedoch schon heute zu gro&szlig;en Investitionen im Hinblick auf die oft zitierte Datenautobahn.
	</p>
	<p>
		Ein wichtiges Instrument im Bereich des elektronischen Verkaufens ist der Elektronische Produktkatalog (EPK). Obwohl die
		meisten gro&szlig;en Produktanbieter heute einen EPK in den Markt einbringen, lassen die darin enthaltenen Pr&auml;sentationen
		oft stark zu w&uuml;nschen &uuml;brig, was auf das fast vollst&auml;ndige Fehlen von Entwicklungswerkzeugen f&uuml;r EPKe
		zur&uuml;ckzuf&uuml;hren ist. In der Regel werden daher Editoren f&uuml;r Multimedia-Pr&auml;sentationen herangezogen,
		um die Entwicklung &uuml;berhaupt angehen zu k&ouml;nnen. Die Ergebnisse sind dann jedoch unweigerlich mit hohen Kosten
		verbunden und sicher nicht optimal.
	</p>
	<p>
		Das Bayerische Forschungszentrum f&uuml;r Wissensbasierte Systeme (FORWISS) hat daraufhin ein Projekt ins Leben gerufen,
		um, in Zusammenarbeit mit drei Universit&auml;ten und einem industriellen Partner, die L&uuml;cke bei der Unterst&uuml;tzung
		der EPK-Entwicklung zu schlie&szlig;en. Gef&ouml;rdert wird das Projekt durch das Bundesministerium f&uuml;r Bildung, Forschung,
		Wissenschaft und Technologie (BMFT).
	</p>
	<p>
		Es wird die gesamte Bandbreite des EPK-Entwicklungsprozesses untersucht werden, von der Analyse der Benutzerbed&uuml;rfnisse
		&uuml;ber formale Spezifikationsmethoden bis hin zur modellbasierten Erzeugung von EPKen und ihrer automatischen Validierung.
		Ziel des Projektes ist eine Bereitstellung verschiedener Werkzeuge in einem Gesamtsystem. Jede Komponente wird dazu in
		einem Teilprojekt entwickelt. Zun&auml;chst steht jedoch die Erarbeitung einer Methodik f&uuml;r die EPK-Entwicklung und
		f&uuml;r EPK-bezogenes Projektmanagement im Vordergrund. Im n&auml;chsten Schritt soll eine formale Beschreibungssprache
		f&uuml;r EPKe spezifiziert werden. Eine Sprache, die auf dem SGML-Standard (Structured Generalized Markup Language) basiert,
		ist geeignet, die Strukturen eines EPK abzubilden. Die zu entwickelnde Beschreibungssprache tr&auml;gt den Namen EPKML.
	</p>
	<p>
		Das EPKfix-Projekt hat im September 1995 begonnen und soll nach zwei Jahren beendet sein. Der geplante Aufwand bel&auml;uft
		sich auf 18 Personenjahre.
	</p>
	<p>
		Quelle: http://www.pst.informatik.uni-muenchen.de/projekte/epkfix-public/ </br>
        Literatur: <a href="http://www.bibsonomy.org/bibtex/214607642be2b2cf6455241cdeb6a8130/funthomas424242">Die Sprache EPKML</a>
	</p>
</body>

</html>